Revit 2027 API
Wave.WaveWaveRadius Property
 The property labeled "Radius" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveWaveRadius { get; }
Public Shared ReadOnly Property WaveWaveRadius As String
	Get
public:
static property String^ WaveWaveRadius {
	String^ get ();
}
static member WaveWaveRadius : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace